[
  {
    "date": "2016-11-17",
    "title": "Harja-järjestelmä Twitterissä",
    "short": "Harja-järjestelmän tiedotteita voi jatkossa seurata myös Twitterissä: https://twitter.com/HarjaLivi",
    "body": ""
  },
  {
    "date": "2016-10-28",
    "title": "Turvallisuuspoikkeamien siirto automaattisesti TURI:n Harjasta 31.10.2016 alkaen",
    "short": "TURI:n ja Harjan välinen rajapinta otetaan käyttöön.",
    "body": "31.10.2016 alkaen turvallisuuspoikkeamat siirretään automaattisesti Harjasta TURI järjestelmään."
  },
  {
    "date": "2016-10-28",
    "title": "Uusi rajapinta urakanyhteystietojen haulle Liikenneviraston järjestelmille",
    "short": "Liikenneviraston järjestelmille on tehty Harjan API:n uusi rajapinta urakan yhteystietojen hakemiseksi.",
    "body": "Yhteystiedot haetaan FIM-järjestelmästä sekä Harjaan tallennetuista yhteystiedoista. Rajapinta on tällä hetkellä sallittu vain Liikenneviraston järjestelmille."
  },
  {
    "date": "2016-10-28",
    "title": "Ilmoitusten välitysviestit näkyville",
    "short": "Ilmoituksista päivystäjille lähetetyistä tekstiviesteistä ja sähköposteista näytetään jatkossa tieto ilmoitusnäkymässä.",
    "body": "Tieto keille päivystäjille ja mitä kanavaa pitkin voidaan jatkossa nähdä Harjan ilmoitusnäkymästä klikkaamalla \"Näytä välitystiedot\". Välitystiedot näytetään kuittausten perässä."
  },
  {
    "date": "2016-10-27",
    "title": "Muutoksia ilmoitusten käsittelyssä",
    "short": "Tekstiviestit vain vastuullisille päivystäjille. Tekstiviestien ja sähköpostien sisältöä laajennettu.",
    "body": "Jatkossa tekstiviestit uusista toimenpidepyynnöistä tullaan lähettämään vain urakan vuorossaoleville vastuullisille päivystäjille. Sähköpostit lähtevät yhä kaikista ilmoituksista kaikille urakan vuorossaoleville päivystäjille. Sähköposteihin & tekstiviesteihin on nyt lisätty tierekisteriosoite & ilmoittajan yhteystiedot."
  },
  {
    "date": "2016-07-04",
    "title": "Varusterajapintojen muutos siirtyy",
    "body": "Varusterajapintojen yksinkertaistaminen siirtyy todennäköisesti tehtäväksi lomien jälkeen elokuussa."
  },
  {
    "date": "2016-07-01",
    "body": "Liikenneviraston tekemä lista urakoissa seurattavista reaaliaikaseurannan ja toteumien yksikkö- sekä kokonaishintaisista tehtävistä viety staginging ympäristöön käyttöön."
  }
]
