[
  {
    "date": "2017-04-04",
    "title": "Mahdollisuus hakea järjestelmäkäyttäjätunnuksella urakat API:n kautta",
    "short": "Jatkossa Harjan API:n kautta voidaan hakea suoraan kaikki urakat, joihin järjestelmätunnuksella on oikeudet",
    "body": "Uuden end-pointin osoite on /api/urakat/haku/. Requestille ei anneta erillisiä parametrejä, vaan käyttäjätunnus luetaan autentikointitiedoista."
  },
  {
    "date": "2017-04-04",
    "title": "Laadunseurannan muutoksia",
    "short": "Laatupoikkeamille voi jatkossa kirjata eksplisiittisen tiedon, sisältääkö poikkeama poikkeamaraportin",
    "body": "Harjaan on jatkossa mahdollista lisätä käyttöliittymän sekä API:n kautta laatupoikkeamille tieto, sisältääkö laatupoikkeama poikkeamaraportin. Tieto erillisen kentän kautta tarvitaan, sillä kirjaus käytännöissä on eri tapoja ja tilaajan täytyy pystyä hakemaan ne poikkeamat, joissa raportti on annettu."
  },
  {
    "date": "2017-02-14",
    "title": "Muutoksia ilmoituksissa: Uusi kuittaustyyppi \"väärä urakka\" sekä ihmisluettava tunniste.",
    "short": "",
    "body": "Harjasta on jatkossa mahdollista tehdä kuittaus väärään urakkaan menneestä ilmoituksesta tieliikennekeskukseen uudella \"väärä urakka\" -kuittauksella. Kuittauksen vastaanotettuaan, tieliikennekeskuspäivystäjä on vastuussa tarkentamaan urakan tiedot ja lähettämään sen uudestaan. Samoin ilmoituksiin on lisätty ns. ihmisluettava tunniste, jolla yksittäinen ilmoitus voidaan jatkossa tunnistaa myös tieliikennekeskuksessa. Tunniste on esimerkiksi muotoa UV-1701-1a, joka on vuoden 2017 tammikuun 1a (järjestysluku) urakoitsijaviesti."
  },
  {
    "date": "2017-02-02",
    "title": "Uusi Tienäkymä",
    "short": "",
    "body": "<p>HARJA:n karttapohjaisessa Tilannekuvassa on käyttäjille tarjolla uusi Tienäkymä toiminnallisuus. </p> <p>Tienäkymässä käyttäjä voi tierekisteriosoitteen perusteella tarkastella valitsemanaan ajankohtana tieosoitteelle tehtyjä toimenpiteitä, tarkastuksia ja ilmoituksia </p>"
  },
  {
    "date": "2017-02-02",
    "title": "HARJA:n mobiili laadunseuranta",
    "short": "",
    "body": "<p>HARJA:n mobiililaadunseurannasta on julkaistu uusi versio, joka on tarjolla tilaajan käyttäjille. Linkki ja ohjeet työkalun käyttäjille löytyy HARJA:n Laadunseuranta -välilehden alta. </p> <p>Uudessa versiossa on kiinnitetty huomiota käytön yksinkertaisuuteen, sekä tarjolla olevien toimintojen tarpeellisuuteen. Otamme mielellämme vastaan palautetta mobiilityökalun toiminnasta. Sitä voit lähettää osoitteeseen harjapalaute@solita.fi</p>"
  },
  {
    "date": "2017-01-10",
    "title": "Harja API: Uudet rajapinnat toteumien & tarkastusten poistamiselle",
    "short": "",
    "body": "Harja API:n kautta on jatkossa mahdollista poistaa ulkoisesta järjestelmästä kirjatut toteumat & tarkastukset. Tarkemmat tiedot löytyvät <a href=\"http://finnishtransportagency.github.io/harja/apidoc/api.html\">API-dokumentaatiosta</a>."
  },
  {
    "date": "2016-12-26",
    "title": "Harjan mobiili laadunseurantatyökalu - kuulumisia",
    "short": "",
    "body": "<p>Harjan mobiililaadunseurantaan on viimeisen kahden kuukauden aikana tehty paljon kehitystä.</p> <p>Työkokalun kautta voidaan kirjata erilaisia havaintoja tien päältä joko nopeasti pikanäppäimillä tai vapaatekstilomakkeella. Samoin voidaan ottaa kameralla valokuvia ja liittää niihin tekstiä. Työkalulla kerätty tieto tallennetaan Harjaan, jossa kertyneitä tarkastuksia voidaan vielä tutkia, muokata ja niiden perusteella voidaan myöhemmin kirjata myös laatupoikkeamia ja/tai sanktioita.</p> <p>Käyttöliittymä toimii tablettitietokoneilla ja älypuhelimilla. Sovellus on selainpohjainen, joten on hyvä laittaa automaattinen virransäästötila pois päältä jotta näyttö ei mene lukkoon kesken ajon. Se saattaa lopettaa tiedonkeruun, ainakin Applen laitteilla.</p> <p>Palautetta työkalun toiminnasta voi laittaa joko osoitteen <a href=\"mailto:harjapalaute@solita.fi\" target=\"_top\">harjapalaute@solita.fi</a> tai suoraan kehitystiimin henkilöille.</p>"
  },
  {
    "date": "2016-11-25",
    "title": "Laajennoksia ilmoituksista lähtevien tekstiviestien ja sähköpostien sisältöihin",
    "short": "",
    "body": "Jatkossa ilmoituksista lähetettävissä tekstiviesteissä ja sähköposteissa tullaan näyttämään sekä ilmoittajan että lähettäjän (tieliikennekeskuspäivystäjän) nimi, puhelinnumero & sähköpostiosoite. Samoin molemmissa viesteissä lähetetään paikan tierekisteriosoite, jos sellainen löytyy."
  },
  {
    "date": "2016-11-22",
    "title": "Ilmoitushaun aikarajaukset muuttuneet",
    "short": "",
    "body": "Tieliikennekeskuksen ilmoitusten aikarajauksia on muutettu niin, että oletuksena näkymä näyttää ilmoitukset kuluneen tunnin ajalta. Vakioaikavälien lisäksi mahdollista on nyt hakea ilmoituksia myös vapaalla päivämäärä- sekä kellonaikarajauksella."
  },
  {
    "date": "2016-11-17",
    "title": "Harja-järjestelmä Twitterissä",
    "short": "Harja-järjestelmän tiedotteita voi jatkossa seurata myös Twitterissä: https://twitter.com/HarjaLivi",
    "body": ""
  },
  {
    "date": "2016-10-28",
    "title": "Turvallisuuspoikkeamien siirto automaattisesti TURI:n Harjasta 31.10.2016 alkaen",
    "short": "TURI:n ja Harjan välinen rajapinta otetaan käyttöön.",
    "body": "31.10.2016 alkaen turvallisuuspoikkeamat siirretään automaattisesti Harjasta TURI järjestelmään."
  },
  {
    "date": "2016-10-28",
    "title": "Uusi rajapinta urakanyhteystietojen haulle Liikenneviraston järjestelmille",
    "short": "Liikenneviraston järjestelmille on tehty Harjan API:n uusi rajapinta urakan yhteystietojen hakemiseksi.",
    "body": "Yhteystiedot haetaan FIM-järjestelmästä sekä Harjaan tallennetuista yhteystiedoista. Rajapinta on tällä hetkellä sallittu vain Liikenneviraston järjestelmille."
  },
  {
    "date": "2016-10-28",
    "title": "Ilmoitusten välitysviestit näkyville",
    "short": "Ilmoituksista päivystäjille lähetetyistä tekstiviesteistä ja sähköposteista näytetään jatkossa tieto ilmoitusnäkymässä.",
    "body": "Tieto keille päivystäjille ja mitä kanavaa pitkin voidaan jatkossa nähdä Harjan ilmoitusnäkymästä klikkaamalla \"Näytä välitystiedot\". Välitystiedot näytetään kuittausten perässä."
  },
  {
    "date": "2016-10-27",
    "title": "Muutoksia ilmoitusten käsittelyssä",
    "short": "Tekstiviestit vain vastuullisille päivystäjille. Tekstiviestien ja sähköpostien sisältöä laajennettu.",
    "body": "Jatkossa tekstiviestit uusista toimenpidepyynnöistä tullaan lähettämään vain urakan vuorossaoleville vastuullisille päivystäjille. Sähköpostit lähtevät yhä kaikista ilmoituksista kaikille urakan vuorossaoleville päivystäjille. Sähköposteihin & tekstiviesteihin on nyt lisätty tierekisteriosoite & ilmoittajan yhteystiedot."
  },
  {
    "date": "2016-07-04",
    "title": "Varusterajapintojen muutos siirtyy",
    "body": "Varusterajapintojen yksinkertaistaminen siirtyy todennäköisesti tehtäväksi lomien jälkeen elokuussa."
  },
  {
    "date": "2016-07-01",
    "body": "Liikenneviraston tekemä lista urakoissa seurattavista reaaliaikaseurannan ja toteumien yksikkö- sekä kokonaishintaisista tehtävistä viety staginging ympäristöön käyttöön."
  }
]
