[
   {
    "date": "2020-5-13",
    "title": "Paikkausten rajapinta ja käyttöliittymä toiminnassa",
    "body": 
    "<p>Paikkausurakoihin liittyen voi nyt tuoda tietoa Harjaan rajapintamäärityksen mukaisesti. Paikkaukset kirjataan aina rajapinnan kautta, kustannukset voidaan kirjata joko käsin tai rajapinnan kautta. Käyttöliittymässä paikkauksille on olemassa oma välilehtensä, mistä löytyy sekä tekniset toteumatiedot että mahdollisuus kirjata kustannukset.<br><br>Toteumatietojen puolella tilaajalla on mahdollisuus raportoida urakoitsijalle päin mahdollisista virheistä, jolloin Harja lähettää asiasta sähköpostin urakoitsijan vastuuhenkilölle, samalla voi halutessan ottaa itselleen kopion viestistä. Hieman myöhemmin on tilaajalle tulossa vielä mahdollisuus lähettää valmistuneet paikkaustiedot tarkistuksen jälkeen YHA:an. Relevantit rajapinnat ovat: <ul><li>https://extranet.vayla.fi/harja/apidoc/api.html#urakat__id__paikkaus_post<li>https://extranet.vayla.fi/harja/apidoc/api.html#urakat__id__paikkaus_kustannus_post</ul></p>"
  },{
    "date": "2020-3-3",
    "title": "MHU-urakoiden sanktiolajit lisätty",
    "body": 
    "<p>MHU-urakoissa on tuttujen sanktiolajien lisäksi käytössä uudet sanktiolajit <br> <ul><li>Lupaussanktio<li>Vastuuhenkilöiden vaihtosanktio<li>Sanktio vastuuhenkilöiden testikeskiarvon laskemisesta<li>Sanktio vastuuhenkilöiden tenttikeskiarvon laskemisesta</ul> <br>Näille sanktiolajeille ei valita sanktiotyyppiä.</p>"
  },
  {
    "date": "2020-2-20",
    "title": "Varusteiden käsittelyyn on tehty parannuksia",
    "body": 
    "<p><b>Urakan varustekirjausten tarkastelu:</b><br> Urakan varustekirjauksia voi rajata Lähetyksen tilan mukaan. Vain virheelliset-valinta palauttaa Varustekirjaukset Harjassa-taulukkoon varusteet, joiden lähetys Tierekisteriin ei ole onnistunut. Tämä helpottaa lähettämättä jääneiden varustekirjausten käsittelyä. <br>Lähettämättä jääneet varustekirjaukset tulee korjata, jotta tiedot päivittyvät Tierekisteriin. Siirron estävä virhe löytyy varusteen tiedoista Muokkaa-painikkeen takaa.</p><p><b>Varusteiden haku Tierekisteristä:</b><br><ul><li>Tr-osoitteella Tierekisteristä haetut varusteet listautuvat tieosoitejärjestyksessä.<li>Varusteluettelossa näytetään varusteen Puoli-tieto<li>Liikennemerkistä näytetään myös Liikennemerkin asetusnumero.</ul> </p> <p><b>Muutokset uuden liikennemerkin syöttöön:</b><br>Jotta tietojen syöttäminen olisi nopeampaa, seuraavat tiedot ovat nyt oletusarvoisesti valittuna:<ul><li>Liikennemerkin tyyppi: 1 Tavallinen<li>Liikennemerkin kiinnitys: 1 Putkivarsi<li>Liikennemerkin materiaali: 1 Alumiini<li>Yleinen kuntoluokitus: 5 Eriomainen</ul></p>"
  },
  {
    "date": "2020-2-18",
    "title": "Alikohteet nyt näkyvissä Ylläpidon tiemerkintäurakoiden aikataulunäkymässä",
    "body": "Olemme toteuttaneet HARJAan alikohteiden näkymisen tiemerkintäurakoiden aikataulunäkymässä. Ominaisuus on nyt HARJAn tuotantokäytössä Ylläpitourakoissa.<ul><li>Alikohteita ei yhäkään näytetä Päällystyspuolen aikataulussa. Tiemerkintäurakan aikataulunäkymässä alikohteet sen sijaan nyt näkyvät. Tiemerkintäurakasta ei alikohteita pääse kuitenkaan muokkaamaan, vaan muokkaaminen tapahtuu käynnissä olevissa päällystysurakoissa.</ul>" 
  },
  {
    "date": "2020-1-27",
    "title": "Alikohteet näkyviin Ylläpidon aikataulunäkymään",
    "body": "<ul><li>Suunnittelemme parhaillaan alikohteiden näkymistä HARJAn Aikataulu-näkymässä. Toteutustyö tehdään helmikuun aikana. Tavoitteenamme on saada uusi näkymä tuotantokäyttöön helmikuun loppuun mennessä.</ul>" 
  },
  {
    "date": "2019-12-19",
    "title": "HARJAan on tammikuussa luvassa seuraavat uudistukset Ylläpidon puolelle",
    "body": "<ul><li>Päällystysurakoiden Kaistamuutokset tulevat voimaan. Muutoksen jälkeen kaistaluku muodostuu siten, että ensimmäinen numero kertoo ajosuunnan ja toinen numero kaistan sijainnin pääkaistaan nähden.</ul>" 
  },
  {
    "date": "2019-11-29",
    "title": "Harja-API:sta on julkaistu versio 1.0.46.",
    "body": "Työkoneseurantarajapintoihin on lisätty työkoneelle uusi tieto tunnus. Kenttä on alfanumeerinen ja sitä käytetään työkoneen yksilöimiseen. Tieto välittyy Harjan lisäksi Liikennetilannepalveluun."  
  },
  {
    "date": "2018-07-19",
    "title": "Tietyöilmoitus PDF lomakkeen lähetys suoraan Harjasta Tieliikennekeskukseen sähköpostitse",
    "body": "Harjasta voi lähettää tietyöilmoituksen Tieliikennekeskukseen. Ilmoitus lähetetään pdf muodossa käyttäjän antamiin sähköpostiosotteisiin sekä käyttäjän valitsemaan keskukseen. Tämä toiminnallisuus löytyy avatun lomakkeen alareunasta."  
  },
  {
    "date": "2018-05-18",
    "title": "Laadunseurantatyökalun käyttöohjeisiin tarkennuksia",
    "body": "Lisäsimme Harjan Laadunseuranta -osioon tarkennuksia laadunseurantatyökalun käytöstä. Lähinnä se, että SIM-kortti ja datayhteys laitteessa nopeuttaa tarkan GPS-sijainnin löytymistä, ja tarkan GPS-sijainnin löytyminen kannattaa odottaa paikallaan autossa ennen tarkastusajon aloittamista."  
  },
  {
    "date": "2018-04-17",
    "title": "Päällystyskohteiden suunnittelu YHA:ssa, tuonti Harjaan ja käsittely Harjassa vuonna 2018",
    "body": "<p>1. Urakan kohteet suunnitellaan mahdollisimman valmiiksi YHA:ssa</p><p>2. Kun kohdeluettelo on YHA:ssa valmis, urakanvalvoja menee Harjaan ja sitoo Harja-urakan oikeaan YHA-urakkaan ja tuo kohdeluettelon YHA:sta Harjaan. Kun kohteet on kerran tuotu YHA:sta, jatkossa tuontinappia painamalla Harjaan tuodaan vain YHA:an mahdollisesti lisätyt uudet kohteet. Toisin sanoen, jo kerran Harjaan tuotuja kohteita ei voi tuoda toiseen kertaan, eikä niitä pidä enää päivittää YHA:ssa koska niitä ei päivityksen jälkeen enää tuoda uudestaan Harjaan. Tuonnin jälkeen kohteiden tietoja ylläpidetään Harjassa aina päällystysilmoituksen lähettämiseen saakka. Päällystysilmoituksen lähettämisen yhteydessä kohteiden toteutuneet tiedot viedään jälleen YHA:an.</p><p>3. Vuodelle 2018 Harjaan on tehty kyvykkyys lisätä pääkohteille alikohteita hieman sallivammin kuin vuonna 2017. Erityisesti ”saumasta saumaan”-vaatimus alikohteille on poistettu, eli alikohteiden on kyllä oltava pääkohteen paaluvälin sisällä, mutta alikohteiden ei ole enää pakko täyttää kokonaan pääkohdetta, vaan tyhjiä välejä eli ns. hyppyjä voidaan jättää. Kun halutaan kirjata hyppy, jätetään ko. tierekisteriosoitevälille kirjaus kokonaan tekemättä. Tämä on mahdollista sekä Harjan käyttöliittymän että urakoitsijarajapinnnan kautta. Tämä ei ollut mahdollista vuonna 2017.</p><p>4. Lisäksi Harjaan on mahdollista kirjata vuonna 2018 alikohteeksi ramppeja ja tumppeja. Tällöin alikohteelle sallitaan eri tienumero kuin pääkohteella.</p><p>5. Jos ramppi tai tumppi on suunniteltu jo YHA:an pääkohteena, käsitellään sitä kuitenkin Harjassakin pääkohteena ja tehdään sille oma POT-ilmoitus. Jos taas ramppi tai tumppi ei ollut YHA:ssa tehdyssä kohdeluettelossa vaan sen tekeminen huomattiin vasta työtä tehdessä, voidaan tällainen ramppi/tumppi kirjata Harjaan myös jonkun pääkohteen alikohteeksi. Tämäkin on uutta vuodelle 2018. Alikohteet joilla on eri tienumero pääkohteen kanssa kirjataan erilliseen kohdelistaan Harjassa, muiden alikohteiden alapuolella olevaan taulukkoon. Harja huolehtii siitä, että samana vuonna ei voi syntyä tieosoitteeltaan päällekkäisiä ramppeja tai tumppia.</p><p>6. Jotta järjestelmien tiedot pysyvät oikeellisina, sekä YHA:an että Harjaan tehdään tiettyjä validointeja. Kun päällystysilmoitus tehdään tietylle pääkohteelle, tarkistetaan että samana vuonna ole toista pääkohdetta jolla olisi edes osittain päällekkäinen tierekisteriosoite. Jos päällekkäisyys löydetään, ilmoitetaan siitä käyttäjälle jo Harjassa.</p>"  
  },
  {
    "date": "2018-03-02",
    "title": "Ylläpitokohteiden hyppy",
    "body": "Ylläpitokohteiden kohdeosille on nyt mahdollista kirjata hypyn sisältävä kohdeosa kohdeluettelissa sekä päällystysilmoitusnäkymässä."
  },
  {
    "date": "2018-01-29",
    "title": "Päällystysilmoituksen täytön helpotus",
    "body": "Päällystysilmoituksessa on nyt mahdollista helposti täyttää tai toistaa rivin arvo seuraaville riveille. Tämä nopeuttaa päällystysilmoituksen täyttöä silloin kun sama arvo toistuu useilla eri riveillä, sillä arvoa ei tarvitse kirjoittaa käsin uudestaan. Tarkempi ohje täytön / toiston käyttöön löytyy päällystysilmoituksesta olevasta vihjeestä."
  },
  {
    "date": "2018-01-24",
    "title": "Päällystys- ja tiemerkintäurakan aikataulun visuaalinen muokkaus",
    "body": "Päällystys- ja tiemerkintäurakoiden aikataulunäkymässä on nyt mahdollista muokata aikataulua visuaalisesti siirtämällä ja venyttämällä aikataulun palkkeja. Tämä helpottaa aikataulun muokkaamista ja mahdollistaa usean eri kohteen aikataulun muokkaamisen yhdellä kertaa. Visuaaliset muokkaukset voi myös kumota helposti mahdollisen virheen sattuessa. Tarkempia ohjeita visuaalisesta muokkauksesta löytyy näkymässä olevan vihjeen kautta."
  },
  {
    "date": "2018-01-17",
    "title": "Päällystyskohteiden aikataulunäkymään voi nyt lisätä itse tarkempia työvaiheita",
    "body": "Päällystyskohteen aikataulutietoon voi nyt kirjata mm. RP-työt, ojankaivuun tai rumpujen vaihdon. Näiden lisäksi voidaan myös vapaatekstinä kirjata muu työvaihe. Näin voidaan seurata mm. päällystämistä edeltäviä työvaiheita entistä tarkemmin."
  },
  {
    "date": "2017-12-18",
    "title": "Urakanvalvoja voi avata hyväksytyn päälystysilmoituksen",
    "body": "Tämä ominaisuus on lisätty lähinnä korjauksia varten."
  },
  {
    "date": "2017-12-18",
    "title": "Päällystysilmoituksen valmistumisesta lähetetään nyt ilmoitus sähköpostiin tilaajan urakanvalvojalle",
    "body": "Kun urakoitsija painaa, \"valmis tilaajan käsiteltäväksi\" POT-lomakkeella, lähtee siitä ilmoitus tilaajan urakanvalvojalle."
  },
  {
    "date": "2017-11-07",
    "title": "Päällystyskohteen takuupäivämäärän voi nyt asettaa usealle kohteelle kerralla",
    "body": "Harja mahdollistaa nyt päällystyskohteen takuupvm:n asettamisen useammalle kohteelle kerralla. Katso <a href=\"https://youtu.be/f2xyQpvJd5k\"> koulutusvideo</a>."
  },
  {
    "date": "2017-11-03",
    "title": "Korjaus 'Muisti ei riitä' tyyppisiin ongelmiin",
    "body": "Harjaan on toteutettu korjaus, minkä ansiosta kohdeluettelossa satunnaisesti tapahtunut selaimen ilmoitus muistin riittämättömyydestä ei pitäisi enää toistua. Korjaus tulee voimaan ensi viikon alussa."
  },
  {
    "date": "2017-08-14",
    "title": "Parannuksia aikataulunäkymään",
    "body": "Ylläpidon urakoiden aikataulunäkymään on toteutettu muutamia pieniä käytettävyysparannuksia. Tiemerkintäurakoitsija näkee jatkossa kohteen päällystysurakan nimen ja sen yhteyshenkilöt omassa sarakkeessa. Tilan säästämiseksi päivämääräkentissä ei enää näytetä vuotta jos se on sama kuin suodattimesta valittu vuosi. Päivämäärää asetettaessa näkyvä kalenteri asettuu alustavasti aina samalle kuukaudelle jolle kohteen edellinen päivämäärämerkintä on asetettu. Aikajanalle piirretään nykyisen päivän kohdalle punainen viiva, joka auttaa hahmottamaan paremmin aikataulun etenemistä. Lisäksi aikajanalla näkyy nyt myös koko kohteen alku ja loppu myös silloin kun vain toinen näistä on asetettu. Kaikki nämä muutokset tulevat Harjaan lähipäivinä."
  },
  {
    "date": "2017-07-10",
    "title": "Tiemerkinnän suunnitellun päivämäärän merkitseminen & sähköposti-ilmoitukset",
    "body": "Jatkossa sähköposti tiemerkinnän valmistumisesta lähetetään vasta tiemerkinnän valmistumispäivänä. Jos tiemerkintä merkitään valmistuneeksi kuluvana päivänä tai menneisyydessä, lähetetään viesti heti. Kyseinen toiminnallisuus tulee käyttöön kuluvan viikon aikana."
  },
  {
    "date": "2017-07-07",
    "title": "Ylläpidon aikataulun tulostaminen PDF:ksi korjattu",
    "body": "Käyttöoikeuksiin liittyvä ongelma ylläpidon aikataulun tulostamisessa on saatu korjattua. Korjaus on tuotannossa käytettävissä maanantaina 10.7. aamulla."
  },
  {
    "date": "2017-06-28",
    "title": "Päällystyskohteen tiemerkintävalmiuden voi nyt myös perua",
    "body": "Päällystysurakan aikataulunäkymässä voidaan asettaa kohde valmiiksi tiemerkintään, mistä seuraa sähköposti-ilmoitus tiemerkintäurakan urakanvalvojalle ja urakoitsijan vastuuhenkilölle. Nyt on mahdollista myös perua tämä toiminto, eli kertoa että kohde ei sittenkään ole vielä valmis tiemerkintään. Perumisesta niin ikään lähtee sähköpostitse tieto tiemerkintäurakkaan."
  },
  {
    "date": "2017-06-05",
    "title": "Harja API: Osoitemuunnokset eri päivän verkolta toiselle",
    "body": "Jatkossa on mahdollista ilmoittaa Harja API:n ylläpitokohteiden osoitteiden mukana lähdejärjestelmän päivän verkko, jonka mukaisesti Harja muuntaa osoitteen uusimman päivän verkolle. Mikäli osoitetta ei anneta oletetaan, että osoite on uusimmalla verkolla ja muunnosta ei tehdä.</ul>"
  },
  {
    "date": "2017-05-11",
    "title": "Linkki roolitaulukkoon",
    "body": "Tieto HARJA:n käyttäjäroolien oikeuksista löytyy tämän linkin takaa: https://github.com/finnishtransportagency/harja/blob/develop/resources/roolit.xlsx"
  },
  {
    "date": "2017-05-11",
    "title": "HARJA:n käyttö Paikkausurakoissa alkaa 1.4.2018",
    "body": "HARJA:n käyttö paikkausurakoissa on suunniteltu alkavaksi vuoden päästä 1.4.2018. Palvelun määrittely työ on parhaillaan meneillään ja toteutus alkaa kesälomien jälkeen. Paikkausurakoiden pilotoinnin on arvioitu tapahtuvan syyskuun jälkeen."
  },
  {
    "date": "2017-05-05",
    "title": "Harja API:n urakoitsijoiden järjestelmätunnusten jakamisesta",
    "body": "Ainut taho, joka tarvitsee urakoitsijan Harja API:n järjestelmätunnukset salasanoineen on urakoitsijan oma järjestelmätoimittaja. Esimerkiksi Solitan Harjan kehitystiimi tarvitsee vain pelkän järjestelmätunnuksen nimen, eivätkä ikinä salasanoja. Salasanojen välittämisessä niitä tarvitseville tahoille täytyy käyttää erityistä huolellisuutta ja mieluusti turvallisempaa kanavaa kuin sähköpostia. Järjestelmätunnusten joutuessa vääriin käsiin, voidaan niillä aiheuttaa huomattavaa vahinkoa urakoitsijan hallinnoimien urakoiden tietoihin."
  },
  {
    "date": "2017-04-10",
    "title": "Tietyoilmoitukset käyttöön Harjassa",
    "body": "Tietyöilmoitusten kirjaus otetaan käyttöön 11.4.2017. Tällöin Harjassa on mahdollista kirjata tietyöilmoitukset, tulostaa ne ja lähettää PDF-tulosteet edelleen Tieliikennekeskukseen."
  },
  {
    "date": "2017-02-14",
    "title": "Ylläpidon urakat käyttämään HARJA-järjestelmää huhtikuun 2017 aikana",
    "body": "<p>Ylläpidon urakoita aletaan viedä HARJA-järjestelmään heti, kun kilpailutus kunkin urakan osalta kevään 2017 mittaan ratkeaa. Urakan HARJAan viennin jälkeen voidaan tietoja alkaa syöttää järjestelmään, jotta urakka on valmis seurantaan heti sen käynnistyessä.</p> <p>HARJA tuo käyttäjille useita etuja urakan hallintaan. Niistä tärkeimpänä urakkaa koskevat tiedot löytyvät HARJA:n myötä kootusti yhdessä paikassa, jonne sekä tilaajalla, että urakoitsijalla on pääsy. Tavoitteena on vähentää/poistaa tarve lähettää excel taulukoita osapuolten välillä urakan tilanteen seuraamiseksi. Toisena tärkeänä yhteistyötä parantavana toiminnallisuutena on HARJA:n tarjoama ajantasainen aikataulunäkymä, joka helpottaa koordinoimaan päällystyksen ja tiemerkinnän yhteistyötä. HARJAa tullaan käyttöönoton jälkeen kehittämään urakoiden työtä helpottavaan suuntaan käyttäjäpalautteen mukaisesti.</p> <p>Tervetuloa käyttämään HARJAa!</p>"
  },
  {
    "date": "2016-10-31",
    "title": "Sähköpostitiedotteet valmistuneesta tiemerkinnästä ja päällystyksestä",
    "body": "Kun päällystysurakoitsija merkitsee päällystyskohteen valmiiksi tiemerkintään, lähetetään tiemerkintäurakan urakoitsijan vastuuhenkilölle sekä ELY:n urakanvalvojalle sähköpostitiedote asiasta. Vastaavasti kun tiemerkintäkohde merkitään valmiiksi, lähetetään päällystysurakan urakoitsijan vastuuhenkilölle sekä ELY:n urakanvalvojalle tiedote asiasta sähköpostitse."
  },
  {
    "date": "2016-07-04",
    "title": "Ylläpidon rajapintojen toteutus aloitettu",
    "body": "Ylläpidon rajapintojen toteutus aloitettu. Ensimmäinen toteutettava rajapinta on ylläpitourakan kohdeluettelon haku."
  }
]
