[
      {
    "date": "2017-05-11",
    "title": "Linkki ajankohtaiseen roolitaulukkoon",
    "body": "Tieto HARJA:n käyttäjäroolien oikeuksista löytyy tämän linkin takaa: https://github.com/finnishtransportagency/harja/blob/develop/resources/roolit.xlsx"
  },
    {
    "date": "2017-05-11",
    "title": "HARJA:n käyttö Paikkausurakoissa alkaa 1.4.2018",
    "body": "HARJA:n käyttö paikkausurakoissa on suunniteltu alkavaksi vuoden päästä 1.4.2018. Palvelun määrittely työ on parhaillaan meneillään ja toteutus alkaa kesälomien jälkeen. Paikkausurakoiden pilotoinnin on arvioitu tapahtuvan syyskuun jälkeen."
  },
  {
    "date": "2017-05-05",
    "title": "Harja API:n urakoitsijoiden järjestelmätunnusten jakamisesta",
    "body": "Ainut taho, joka tarvitsee urakoitsijan Harja API:n järjestelmätunnukset salasanoineen on urakoitsijan oma järjestelmätoimittaja. Esimerkiksi Solitan Harjan kehitystiimi tarvitsee vain pelkän järjestelmätunnuksen nimen, eivätkä ikinä salasanoja. Salasanojen välittämisessä niitä tarvitseville tahoille täytyy käyttää erityistä huolellisuutta ja mieluusti turvallisempaa kanavaa kuin sähköpostia. Järjestelmätunnusten joutuessa vääriin käsiin, voidaan niillä aiheuttaa huomattavaa vahinkoa urakoitsijan hallinnoimien urakoiden tietoihin."
  },
  {
    "date": "2017-04-10",
    "title": "Tietyoilmoitukset käyttöön Harjassa",
    "body": "Tietyöilmoitusten kirjaus otetaan käyttöön 11.4.2017. Tällöin Harjassa on mahdollista kirjata tietyöilmoitukset, tulostaa ne ja lähettää PDF-tulosteet edelleen Tieliikennekeskukseen."
  },
  {
    "date": "2017-02-14",
    "title": "Ylläpidon urakat käyttämään HARJA-järjestelmää huhtikuun 2017 aikana",
    "body": "<p>Ylläpidon urakoita aletaan viedä HARJA-järjestelmään heti, kun kilpailutus kunkin urakan osalta kevään 2017 mittaan ratkeaa. Urakan HARJAan viennin jälkeen voidaan tietoja alkaa syöttää järjestelmään, jotta urakka on valmis seurantaan heti sen käynnistyessä.</p> <p>HARJA tuo käyttäjille useita etuja urakan hallintaan. Niistä tärkeimpänä urakkaa koskevat tiedot löytyvät HARJA:n myötä kootusti yhdessä paikassa, jonne sekä tilaajalla, että urakoitsijalla on pääsy. Tavoitteena on vähentää/poistaa tarve lähettää excel taulukoita osapuolten välillä urakan tilanteen seuraamiseksi. Toisena tärkeänä yhteistyötä parantavana toiminnallisuutena on HARJA:n tarjoama ajantasainen aikataulunäkymä, joka helpottaa koordinoimaan päällystyksen ja tiemerkinnän yhteistyötä. HARJAa tullaan käyttöönoton jälkeen kehittämään urakoiden työtä helpottavaan suuntaan käyttäjäpalautteen mukaisesti.</p> <p>Tervetuloa käyttämään HARJAa!</p>"
  },
  {
    "date": "2016-10-31",
    "title": "Sähköpostitiedotteet valmistuneesta tiemerkinnästä ja päällystyksestä",
    "body": "Kun päällystysurakoitsija merkitsee päällystyskohteen valmiiksi tiemerkintään, lähetetään tiemerkintäurakan urakoitsijan vastuuhenkilölle sekä ELY:n urakanvalvojalle sähköpostitiedote asiasta. Vastaavasti kun tiemerkintäkohde merkitään valmiiksi, lähetetään päällystysurakan urakoitsijan vastuuhenkilölle sekä ELY:n urakanvalvojalle tiedote asiasta sähköpostitse."
  },
  {
    "date": "2016-07-04",
    "title": "Ylläpidon rajapintojen toteutus aloitettu",
    "body": "Ylläpidon rajapintojen toteutus aloitettu. Ensimmäinen toteutettava rajapinta on ylläpitourakan kohdeluettelon haku."
  }
]
